liaokeyre/burncob/main/STC15xxxxxx.h
//						   7     6       5      4     3      2      1      0    Reset Value
//sfr AUXR  = 0x8E;		T0x12 T1x12 UART_M0x6  T2R  T2_C/T T2x12 EXTRAM  S1ST2  0000,0000	//Auxiliary Register 

#define 	Timer0_1T()					AUXR |=  (1<<7)	//Timer0 clodk = fo
#define 	Timer0_12T()				AUXR &= ~(1<<7)	//Timer0 clodk = fo/12	12分频,	default
#define 	Timer1_1T()					AUXR |=  (1<<6)	//Timer1 clodk = fo
#define 	Timer1_12T()				AUXR &= ~(1<<6)	//Timer1 clodk = fo/12	12分频,	default
#define		S1_M0x6()					AUXR |=  (1<<5)	//UART Mode0 Speed is 6x Standard
#define		S1_M0x1()					AUXR &= ~(1<<5)	//default,	UART Mode0 Speed is Standard
#define 	Timer2_Run()	 			AUXR |=  (1<<4)	//允许定时器2计数
#define 	Timer2_Stop()	 			AUXR &= ~(1<<4)	//禁止定时器2计数
#define		Timer2_AsCounterP31()		AUXR |=  (1<<3)	//时器2用做计数器
#define		Timer2_AsTimer()			AUXR &= ~(1<<3)	//时器2用做定时器
#define 	Timer2_1T()					AUXR |=  (1<<2)	//Timer0 clodk = fo
#define 	Timer2_12T()				AUXR &= ~(1<<2)	//Timer0 clodk = fo/12	12分频,	default
#define 	ExternalRAM_enable()		AUXR |=  (1<<1)	//允许外部XRAM，禁止使用内部1024RAM
#define 	InternalRAM_enable()		AUXR &= ~(1<<1)	//禁止外部XRAM，允许使用内部1024RAM
#define 	S1_BRT_UseTimer2()	        AUXR |=  1		//选择定时器2作为串口1波特率发生器
#define 	S1_BRT_UseTimer1()	        AUXR &= ~1		//选择定时器1作为串口1波特率发生器
//						   7     6       5      4     3      2      1      0    Reset Value
//sfr T4T3M  = 0xD1;	  T4R  T4_C/T  T4X12  T4CLKO T3R  T3_C/T  T2X12  T3CLKO 0000,0000	//Auxiliary Register 

#define 	Timer4_Run()	 			T4T3M |=  (1<<7)	//允许定时器3计数
#define 	Timer4_Stop()	 			T4T3M &= ~(1<<7)	//禁止定时器3计数
#define		Timer4_AsCounterP05()		T4T3M |=  (1<<6)	//时器3用做计数器
#define		Timer4_AsTimer()			T4T3M &= ~(1<<6)	//时器3用做定时器
#define 	Timer4_1T()					T4T3M |=  (1<<5)	//Timer3 clodk = fo
#define 	Timer4_12T()				T4T3M &= ~(1<<5)	//Timer3 clodk = fo/12	12分频,	default
#define		Timer4_ClkOutEnableP06()	T4T3M |=  (1<<4)	//允许时器4时钟输出
#define		Timer4_ClkOutDisableP06()	T4T3M &= ~(1<<4)	//禁止时器4时钟输出
#define 	Timer3_Run()	 			T4T3M |=  (1<<3)	//允许定时器3计数
#define 	Timer3_Stop()	 			T4T3M &= ~(1<<3)	//禁止定时器3计数
#define		Timer3_AsCounterP05()		T4T3M |=  (1<<2)	//时器3用做计数器
#define		Timer3_AsTimer()			T4T3M &= ~(1<<2)	//时器3用做定时器
#define 	Timer3_1T()					T4T3M |=  (1<<1)	//Timer3 clodk = fo
#define 	Timer3_12T()				T4T3M &= ~(1<<1)	//Timer3 clodk = fo/12	12分频,	default
#define		Timer3_ClkOutEnableP04()	T4T3M |=   1	    //允许时器3时钟输出
#define		Timer3_ClkOutDisableP04()	T4T3M &= ~ 1	    //禁止时器3时钟输出

//sfr INT_CLKO （AUXR2） = 0x8F;	//附加的 SFR WAKE_CLKO (地址：0x8F)
/*
    7   6    5    4   3     2        1       0         Reset Value
    -  EX4  EX3  EX2  -   T2CLKO   T1CLKO  T0CLKO      0000,0000B
b6 -  EX4      : 外中断INT4允许
b5 -  EX3      : 外中断INT3允许
b4 -  EX2      : 外中断INT2允许
b2 - T1CLKO    : 允许 T2 溢出脉冲在P3.0脚输出，Fck1 = 1/2 T1 溢出率
b1 - T1CLKO    : 允许 T1 溢出脉冲在P3.4脚输出，Fck1 = 1/2 T1 溢出率
b0 - T0CLKO    : 允许 T0 溢出脉冲在P3.5脚输出，Fck0 = 1/2 T0 溢出率
*/
#define		T0_pulseP34_enable()		AUXR2 |=  1		    //允许 T0 溢出脉冲在T0(P3.5)脚输出，Fck0 = 1/2 T0 溢出率，T0可以1T或12T。
#define		T0_pulseP34_disable()		AUXR2 &= ~1
#define		T1_pulseP35_enable()		AUXR2 |=  (1<<1)	//允许 T1 溢出脉冲在T1(P3.4)脚输出，Fck1 = 1/2 T1 溢出率，T1可以1T或12T。
#define		T1_pulseP35_disable()		AUXR2 &= ~(1<<1)
#define		T2_pulseP30_enable()		AUXR2 |=  (1<<2)	//允许 T2 溢出脉冲在T1(P3.0)脚输出，Fck2 = 1/2 T2 溢出率，T2可以1T或12T。
#define		T2_pulseP30_disable()		AUXR2 &= ~(1<<2)
#define		T0_pulseP35(n)		        ET0=0,Timer0_AsTimer(),Timer0_1T(),Timer0_16bitAutoReload(),TH0=(65536-(n/2+MAIN_Fosc/2)/(n))/256,TL0=(65536-(n/2+MAIN_Fosc/2)/(n))%256,AUXR2 |= bit0,TR0=1		//fx=fosc/(2*M)/n,  M=1 or M=12
#define		T1_pulseP34(n)		        ET1=0,Timer1_AsTimer(),Timer1_1T(),Timer1_16bitAutoReload(),TH1=(65536-(n/2+MAIN_Fosc/2)/(n))/256,TL1=(65536-(n/2+MAIN_Fosc/2)/(n))%256,AUXR2 |= bit1,TR1=1		//fx=fosc/(2*M)/n,  M=1 or M=12
#define		T2_pulseP30(n)		        Timer2_InterruptDisable(),Timer2_AsTimer(),Timer2_1T(),TH2=(65536-(n/2+MAIN_Fosc/2)/(n))/256,TL2=(65536-(n/2+MAIN_Fosc/2)/(n))%256,AUXR2 |= bit2,Timer2_Run()	//fx=fosc/(2*M)/n,  M=1 or M=12
#define     Ex2_int_Enable()			AUXR2 |=  (1<<4)	 //允许外部中断2中断
#define     Ex2_int_Disable()			AUXR2 &= ~(1<<4)	 //禁止外部中断2中断
#define     Ex3_int_Enable()			AUXR2 |=  (1<<5)	 //允许外部中断3中断
#define     Ex3_int_Disable()			AUXR2 &= ~(1<<5)	 //禁止外部中断3中断
#define     Ex4_int_Enable()			AUXR2 |=  (1<<6)	 //允许外部中断4中断
#define     Ex4_int_Disable()			AUXR2 &= ~(1<<6)	 //禁止外部中断4中断


#define		Timer0_Load(n)		TH0 = (n) / 256,	TL0 = (n) % 256
#define		Timer1_Load(n)		TH1 = (n) / 256,	TL1 = (n) % 256
#define		Timer2_Load(n)		TH2 = (n) / 256,	TL2 = (n) % 256

#define		Timer0_Load_us(n)	TH0=(65536-MainFosc_KHZ*(n)/1000)/256,TL0=(65536-MainFosc_KHZ*(n)/1000)%256
#define		Timer1_Load_us(n)	TH1=(65536-MainFosc_KHZ*(n)/1000)/256,TL1=(65536-MainFosc_KHZ*(n)/1000)%256
#define		Timer2_Load_us(n)	TH2=(65536-MainFosc_KHZ*(n)/1000)/256,TL2=(65536-MainFosc_KHZ*(n)/1000)%256


//sfr WDT_CONTR = 0xC1; //Watch-Dog-Timer Control register
//                                      7     6     5      4       3      2   1   0     Reset Value
//                                  WDT_FLAG  -  EN_WDT CLR_WDT IDLE_WDT PS2 PS1 PS0    xx00,0000
#define D_WDT_FLAG			(1<<7)
#define D_EN_WDT			(1<<5)
#define D_CLR_WDT			(1<<4)	//auto clear
#define D_IDLE_WDT			(1<<3)	//WDT counter when Idle
#define D_WDT_SCALE_2		0
#define D_WDT_SCALE_4		1
#define D_WDT_SCALE_8		2		//T=393216*N/fo
#define D_WDT_SCALE_16		3
#define D_WDT_SCALE_32		4
#define D_WDT_SCALE_64		5
#define D_WDT_SCALE_128		6
#define D_WDT_SCALE_256		7
#define	WDT_reset(n)	WDT_CONTR = D_EN_WDT + D_CLR_WDT + D_IDLE_WDT + (n)		//初始化WDT，喂狗


//						  7     6      5    4     3      2    1     0     Reset Value
//sfr PCON   = 0x87;	SMOD  SMOD0  LVDF  POF   GF1    GF0   PD   IDL    0001,0000	 //Power Control 
//SMOD		//串口双倍速
//SMOD0
#define		LVDF		(1<<5)	//P4.6低压检测标志
//POF
//GF1
//GF0
//#define 	D_PD		2		//set 1, power down mode
//#define 	D_IDLE		1		//set 1, idle mode
#define		MCU_IDLE()			PCON |= 1	//MCU 进入 IDLE 模式
#define		MCU_POWER_DOWN()	PCON |= 2	//MCU 进入 睡眠 模式


//sfr ISP_CMD   = 0xC5;
#define		ISP_STANDBY()	ISP_CMD = 0		//ISP空闲命令（禁止）
#define		ISP_READ()		ISP_CMD = 1		//ISP读出命令
#define		ISP_WRITE()		ISP_CMD = 2		//ISP写入命令
#define		ISP_ERASE()		ISP_CMD = 3		//ISP擦除命令

//sfr ISP_TRIG  = 0xC6;
#define 	ISP_TRIG()	ISP_TRIG = 0x5A,	ISP_TRIG = 0xA5		//ISP触发命令

